app/controllers/api/v1/movies_controller.rb

  def index
    movies = Movie.all
---
SELECT "movies".* FROM "movies"

  def create
    movie = Movie.new(movie_params)
    if movie.save
---
INSERT INTO "movies" ("name", "genre", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", "Uncharted"], ["genre", "Action/Adventure"], ["created_at", "2023-12-16 23:02:35.466376"], ["updated_at", "2023-12-16 23:02:35.466376"]]

  def update
    if @movie.update(movie_params)
---
UPDATE "movies" SET "genre" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["genre", "Comedy/Drama"], ["updated_at", "2023-12-16 23:02:47.011709"], ["id", 1]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 2]]

  def set_movie
    @movie = Movie.find_by(id: params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]